app/controllers/home_controller.rb

  def profile

    @user = User.find_by_secret_token(params[:secret_token])
---
SELECT  "users".* FROM "users"  WHERE "users"."secret_token" = 'QBMtdgUaawzaDVPGCa_LsQ' LIMIT 1