app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = $1, "zip" = $2 WHERE "users"."id" = 2  [["updated_at", "2015-03-30 11:35:36.684692"], ["zip", "111"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
           if current_user
    @user.destroy